app/controllers/books_controller.rb

SELECT * FROM `books`
---
  def index
    @books = Book.all

SELECT * FROM `books` WHERE (`books`.`id` = 0)
---
  def show
    @book = Book.find(params[:id])

SELECT * FROM `books` WHERE (`books`.`id` = 2)
---
  def edit
    @book = Book.find(params[:id])

INSERT INTO `books` (`title`, `isbn`, `created_at`, `updated_at`) VALUES('ssss', 'ss', '2011-12-17 07:58:54', '2011-12-17 07:58:54')
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save